[
  {
    "status": "down",
    "affectedServices": "JASMIN accounts portal",
    "summary": "Scheduled maintenance",
    "date": "2023-12-14T14:00:00",
    "updates": [
        {
            "date": "2023-12-11T14:00:00",
            "details": "The JASMIN accounts portal will be unavailable for a short period on Thursday afternoon 14 Dec 2023 to enable its database to be moved to a new server. During this time users will be unable to create new accounts, change their SSH keys or apply for access to services."
        }
    ]
  },
  {
      "status": "at risk",
      "affectedServices": "CEDA website & catalogue services",
      "summary": "Scheduled maintenance",
      "date": "2023-12-12T08:00:00",
      "updates": [
          {
              "date": "2023-12-11T11:00:00",
              "details": "CEDA website at www.ceda.ac.uk may be unavailable on the morning of Tues 12 Dec due to scheduled maintenance. Bug fixes/enhancements also planned for the CEDA catalogue service during this period."
          }
      ]
  },
  {
      "status": "at risk",
      "affectedServices": "Globus data transfers",
      "summary": "JASMIN Globus endpoint replacement",
      "date": "2023-11-29T08:00:00",
      "updates": [
          {
            "date": "2023-12-29T11:00:00",
            "details": "See link for details of new endpoint. Existing endpoint will cease to operate on 18 Dec 2023.",
            "url": "https://help.jasmin.ac.uk/article/5106-globus-transfers-with-jasmin"
          },
          {
              "date": "2023-11-29T08:00:00",
              "details": "The JASMIN Globus endpoint used for data transfers using the Globus online service will need to be replaced before mid-December. Exact dates TBC, please look out for further announcements if you use Globus to transfer data to/from JASMIN."
          }
      ]
  },
  {
      "status": "degraded",
      "affectedServices": "All services",
      "summary": "All services at risk due to network issue",
      "date": "2023-10-13T20:15:00",
      "updates": [
          {
              "date": "2023-12-12T10:00:00",
              "details": "Network issue currently affecting LOTUS, physical sci machines (sci3,6,8) and object storage. Other dependent services may also be affected. Technical staff actively investigating."
          },
          {
              "date": "2023-10-13T20:15:00",
              "details": "Network component failure overnight has caused temporary outages to many JASMIN and CEDA services. Interventions have been partially successful but those systems now working remain at risk. Some LOTUS jobs may have failed. *At risk* status likely to remain in place for some time (weeks) while a permanent solution is sought."
          }
      ]
  }
]